Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_mc00_cnano/pic32cmmc_smart_tag_google_cloud_iot_core/firmware/src/packs/PIC32CM1216MC00032_DFP/component/sdadc.h
/* -------- SDADC_EVCTRL : (SDADC Offset: 0x04) (R/W 8) Event Control -------- */
#define SDADC_EVCTRL_RESETVALUE               _U_(0x00)                                            /**<  (SDADC_EVCTRL) Event Control  Reset Value */

#define SDADC_EVCTRL_FLUSHEI_Pos              _U_(0)                                               /**< (SDADC_EVCTRL) Flush Event Input Enable Position */
#define SDADC_EVCTRL_FLUSHEI_Msk              (_U_(0x1) << SDADC_EVCTRL_FLUSHEI_Pos)               /**< (SDADC_EVCTRL) Flush Event Input Enable Mask */
#define SDADC_EVCTRL_FLUSHEI(value)           (SDADC_EVCTRL_FLUSHEI_Msk & ((value) << SDADC_EVCTRL_FLUSHEI_Pos))
#define SDADC_EVCTRL_STARTEI_Pos              _U_(1)                                               /**< (SDADC_EVCTRL) Start Conversion Event Input Enable Position */
#define SDADC_EVCTRL_STARTEI_Msk              (_U_(0x1) << SDADC_EVCTRL_STARTEI_Pos)               /**< (SDADC_EVCTRL) Start Conversion Event Input Enable Mask */
#define SDADC_EVCTRL_STARTEI(value)           (SDADC_EVCTRL_STARTEI_Msk & ((value) << SDADC_EVCTRL_STARTEI_Pos))
#define SDADC_EVCTRL_FLUSHINV_Pos             _U_(2)                                               /**< (SDADC_EVCTRL) Flush Event Invert Enable Position */
#define SDADC_EVCTRL_FLUSHINV_Msk             (_U_(0x1) << SDADC_EVCTRL_FLUSHINV_Pos)              /**< (SDADC_EVCTRL) Flush Event Invert Enable Mask */
#define SDADC_EVCTRL_FLUSHINV(value)          (SDADC_EVCTRL_FLUSHINV_Msk & ((value) << SDADC_EVCTRL_FLUSHINV_Pos))
#define SDADC_EVCTRL_STARTINV_Pos             _U_(3)                                               /**< (SDADC_EVCTRL) Satrt Event Invert Enable Position */
#define SDADC_EVCTRL_STARTINV_Msk             (_U_(0x1) << SDADC_EVCTRL_STARTINV_Pos)              /**< (SDADC_EVCTRL) Satrt Event Invert Enable Mask */
#define SDADC_EVCTRL_STARTINV(value)          (SDADC_EVCTRL_STARTINV_Msk & ((value) << SDADC_EVCTRL_STARTINV_Pos))
#define SDADC_EVCTRL_RESRDYEO_Pos             _U_(4)                                               /**< (SDADC_EVCTRL) Result Ready Event Out Position */
#define SDADC_EVCTRL_RESRDYEO_Msk             (_U_(0x1) << SDADC_EVCTRL_RESRDYEO_Pos)              /**< (SDADC_EVCTRL) Result Ready Event Out Mask */
#define SDADC_EVCTRL_RESRDYEO(value)          (SDADC_EVCTRL_RESRDYEO_Msk & ((value) << SDADC_EVCTRL_RESRDYEO_Pos))
#define SDADC_EVCTRL_WINMONEO_Pos             _U_(5)                                               /**< (SDADC_EVCTRL) Window Monitor Event Out Position */
#define SDADC_EVCTRL_WINMONEO_Msk             (_U_(0x1) << SDADC_EVCTRL_WINMONEO_Pos)              /**< (SDADC_EVCTRL) Window Monitor Event Out Mask */
#define SDADC_EVCTRL_WINMONEO(value)          (SDADC_EVCTRL_WINMONEO_Msk & ((value) << SDADC_EVCTRL_WINMONEO_Pos))
#define SDADC_EVCTRL_Msk                      _U_(0x3F)                                            /**< (SDADC_EVCTRL) Register Mask  */


/* -------- SDADC_INTENCLR : (SDADC Offset: 0x05) (R/W 8) Interrupt Enable Clear -------- */
#define SDADC_INTENCLR_RESETVALUE             _U_(0x00)                                            /**<  (SDADC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SDADC_INTENCLR_RESRDY_Pos             _U_(0)                                               /**< (SDADC_INTENCLR) Result Ready Interrupt Disable Position */
#define SDADC_INTENCLR_RESRDY_Msk             (_U_(0x1) << SDADC_INTENCLR_RESRDY_Pos)              /**< (SDADC_INTENCLR) Result Ready Interrupt Disable Mask */
#define SDADC_INTENCLR_RESRDY(value)          (SDADC_INTENCLR_RESRDY_Msk & ((value) << SDADC_INTENCLR_RESRDY_Pos))
#define SDADC_INTENCLR_OVERRUN_Pos            _U_(1)                                               /**< (SDADC_INTENCLR) Overrun Interrupt Disable Position */
#define SDADC_INTENCLR_OVERRUN_Msk            (_U_(0x1) << SDADC_INTENCLR_OVERRUN_Pos)             /**< (SDADC_INTENCLR) Overrun Interrupt Disable Mask */
#define SDADC_INTENCLR_OVERRUN(value)         (SDADC_INTENCLR_OVERRUN_Msk & ((value) << SDADC_INTENCLR_OVERRUN_Pos))
#define SDADC_INTENCLR_WINMON_Pos             _U_(2)                                               /**< (SDADC_INTENCLR) Window Monitor Interrupt Disable Position */
#define SDADC_INTENCLR_WINMON_Msk             (_U_(0x1) << SDADC_INTENCLR_WINMON_Pos)              /**< (SDADC_INTENCLR) Window Monitor Interrupt Disable Mask */
#define SDADC_INTENCLR_WINMON(value)          (SDADC_INTENCLR_WINMON_Msk & ((value) << SDADC_INTENCLR_WINMON_Pos))
#define SDADC_INTENCLR_Msk                    _U_(0x07)                                            /**< (SDADC_INTENCLR) Register Mask  */


/* -------- SDADC_INTENSET : (SDADC Offset: 0x06) (R/W 8) Interrupt Enable Set -------- */
#define SDADC_INTENSET_RESETVALUE             _U_(0x00)                                            /**<  (SDADC_INTENSET) Interrupt Enable Set  Reset Value */

#define SDADC_INTENSET_RESRDY_Pos             _U_(0)                                               /**< (SDADC_INTENSET) Result Ready Interrupt Enable Position */
#define SDADC_INTENSET_RESRDY_Msk             (_U_(0x1) << SDADC_INTENSET_RESRDY_Pos)              /**< (SDADC_INTENSET) Result Ready Interrupt Enable Mask */
#define SDADC_INTENSET_RESRDY(value)          (SDADC_INTENSET_RESRDY_Msk & ((value) << SDADC_INTENSET_RESRDY_Pos))
#define SDADC_INTENSET_OVERRUN_Pos            _U_(1)                                               /**< (SDADC_INTENSET) Overrun Interrupt Enable Position */
#define SDADC_INTENSET_OVERRUN_Msk            (_U_(0x1) << SDADC_INTENSET_OVERRUN_Pos)             /**< (SDADC_INTENSET) Overrun Interrupt Enable Mask */
#define SDADC_INTENSET_OVERRUN(value)         (SDADC_INTENSET_OVERRUN_Msk & ((value) << SDADC_INTENSET_OVERRUN_Pos))
#define SDADC_INTENSET_WINMON_Pos             _U_(2)                                               /**< (SDADC_INTENSET) Window Monitor Interrupt Enable Position */
#define SDADC_INTENSET_WINMON_Msk             (_U_(0x1) << SDADC_INTENSET_WINMON_Pos)              /**< (SDADC_INTENSET) Window Monitor Interrupt Enable Mask */
#define SDADC_INTENSET_WINMON(value)          (SDADC_INTENSET_WINMON_Msk & ((value) << SDADC_INTENSET_WINMON_Pos))
#define SDADC_INTENSET_Msk                    _U_(0x07)                                            /**< (SDADC_INTENSET) Register Mask  */


/* -------- SDADC_INTFLAG : (SDADC Offset: 0x07) (R/W 8) Interrupt Flag Status and Clear -------- */
#define SDADC_INTFLAG_RESETVALUE              _U_(0x00)                                            /**<  (SDADC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define SDADC_INTFLAG_RESRDY_Pos              _U_(0)                                               /**< (SDADC_INTFLAG) Result Ready Interrupt Flag Position */
#define SDADC_INTFLAG_RESRDY_Msk              (_U_(0x1) << SDADC_INTFLAG_RESRDY_Pos)               /**< (SDADC_INTFLAG) Result Ready Interrupt Flag Mask */
#define SDADC_INTFLAG_RESRDY(value)           (SDADC_INTFLAG_RESRDY_Msk & ((value) << SDADC_INTFLAG_RESRDY_Pos))
#define SDADC_INTFLAG_OVERRUN_Pos             _U_(1)                                               /**< (SDADC_INTFLAG) Overrun Interrupt Flag Position */
#define SDADC_INTFLAG_OVERRUN_Msk             (_U_(0x1) << SDADC_INTFLAG_OVERRUN_Pos)              /**< (SDADC_INTFLAG) Overrun Interrupt Flag Mask */
#define SDADC_INTFLAG_OVERRUN(value)          (SDADC_INTFLAG_OVERRUN_Msk & ((value) << SDADC_INTFLAG_OVERRUN_Pos))
#define SDADC_INTFLAG_WINMON_Pos              _U_(2)                                               /**< (SDADC_INTFLAG) Window Monitor Interrupt Flag Position */
#define SDADC_INTFLAG_WINMON_Msk              (_U_(0x1) << SDADC_INTFLAG_WINMON_Pos)               /**< (SDADC_INTFLAG) Window Monitor Interrupt Flag Mask */
#define SDADC_INTFLAG_WINMON(value)           (SDADC_INTFLAG_WINMON_Msk & ((value) << SDADC_INTFLAG_WINMON_Pos))
#define SDADC_INTFLAG_Msk                     _U_(0x07)                                            /**< (SDADC_INTFLAG) Register Mask  */


