Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_mc00_cnano/pic32cmmc_smart_tag_google_cloud_iot_core/firmware/src/packs/PIC32CM1216MC00032_DFP/component/sdadc.h
/* -------- SDADC_OFFSETCORR : (SDADC Offset: 0x14) (R/W 32) Offset Correction -------- */
#define SDADC_OFFSETCORR_RESETVALUE           _U_(0x00)                                            /**<  (SDADC_OFFSETCORR) Offset Correction  Reset Value */

#define SDADC_OFFSETCORR_OFFSETCORR_Pos       _U_(0)                                               /**< (SDADC_OFFSETCORR) Offset Correction Value Position */
#define SDADC_OFFSETCORR_OFFSETCORR_Msk       (_U_(0xFFFFFF) << SDADC_OFFSETCORR_OFFSETCORR_Pos)   /**< (SDADC_OFFSETCORR) Offset Correction Value Mask */
#define SDADC_OFFSETCORR_OFFSETCORR(value)    (SDADC_OFFSETCORR_OFFSETCORR_Msk & ((value) << SDADC_OFFSETCORR_OFFSETCORR_Pos))
#define SDADC_OFFSETCORR_Msk                  _U_(0x00FFFFFF)                                      /**< (SDADC_OFFSETCORR) Register Mask  */


/* -------- SDADC_GAINCORR : (SDADC Offset: 0x18) (R/W 16) Gain Correction -------- */
#define SDADC_GAINCORR_RESETVALUE             _U_(0x01)                                            /**<  (SDADC_GAINCORR) Gain Correction  Reset Value */

#define SDADC_GAINCORR_GAINCORR_Pos           _U_(0)                                               /**< (SDADC_GAINCORR) Gain Correction Value Position */
#define SDADC_GAINCORR_GAINCORR_Msk           (_U_(0x3FFF) << SDADC_GAINCORR_GAINCORR_Pos)         /**< (SDADC_GAINCORR) Gain Correction Value Mask */
#define SDADC_GAINCORR_GAINCORR(value)        (SDADC_GAINCORR_GAINCORR_Msk & ((value) << SDADC_GAINCORR_GAINCORR_Pos))
#define SDADC_GAINCORR_Msk                    _U_(0x3FFF)                                          /**< (SDADC_GAINCORR) Register Mask  */


/* -------- SDADC_SHIFTCORR : (SDADC Offset: 0x1A) (R/W 8) Shift Correction -------- */
#define SDADC_SHIFTCORR_RESETVALUE            _U_(0x00)                                            /**<  (SDADC_SHIFTCORR) Shift Correction  Reset Value */

#define SDADC_SHIFTCORR_SHIFTCORR_Pos         _U_(0)                                               /**< (SDADC_SHIFTCORR) Shift Correction Value Position */
#define SDADC_SHIFTCORR_SHIFTCORR_Msk         (_U_(0xF) << SDADC_SHIFTCORR_SHIFTCORR_Pos)          /**< (SDADC_SHIFTCORR) Shift Correction Value Mask */
#define SDADC_SHIFTCORR_SHIFTCORR(value)      (SDADC_SHIFTCORR_SHIFTCORR_Msk & ((value) << SDADC_SHIFTCORR_SHIFTCORR_Pos))
#define SDADC_SHIFTCORR_Msk                   _U_(0x0F)                                            /**< (SDADC_SHIFTCORR) Register Mask  */


/* -------- SDADC_SWTRIG : (SDADC Offset: 0x1C) (R/W 8) Software Trigger -------- */
#define SDADC_SWTRIG_RESETVALUE               _U_(0x00)                                            /**<  (SDADC_SWTRIG) Software Trigger  Reset Value */

#define SDADC_SWTRIG_FLUSH_Pos                _U_(0)                                               /**< (SDADC_SWTRIG) SDADC Flush Position */
#define SDADC_SWTRIG_FLUSH_Msk                (_U_(0x1) << SDADC_SWTRIG_FLUSH_Pos)                 /**< (SDADC_SWTRIG) SDADC Flush Mask */
#define SDADC_SWTRIG_FLUSH(value)             (SDADC_SWTRIG_FLUSH_Msk & ((value) << SDADC_SWTRIG_FLUSH_Pos))
#define SDADC_SWTRIG_START_Pos                _U_(1)                                               /**< (SDADC_SWTRIG) Start SDADC Conversion Position */
#define SDADC_SWTRIG_START_Msk                (_U_(0x1) << SDADC_SWTRIG_START_Pos)                 /**< (SDADC_SWTRIG) Start SDADC Conversion Mask */
#define SDADC_SWTRIG_START(value)             (SDADC_SWTRIG_START_Msk & ((value) << SDADC_SWTRIG_START_Pos))
#define SDADC_SWTRIG_Msk                      _U_(0x03)                                            /**< (SDADC_SWTRIG) Register Mask  */


/* -------- SDADC_SYNCBUSY : (SDADC Offset: 0x20) ( R/ 32) Synchronization Busy -------- */
#define SDADC_SYNCBUSY_RESETVALUE             _U_(0x00)                                            /**<  (SDADC_SYNCBUSY) Synchronization Busy  Reset Value */

#define SDADC_SYNCBUSY_SWRST_Pos              _U_(0)                                               /**< (SDADC_SYNCBUSY) SWRST Synchronization Busy Position */
#define SDADC_SYNCBUSY_SWRST_Msk              (_U_(0x1) << SDADC_SYNCBUSY_SWRST_Pos)               /**< (SDADC_SYNCBUSY) SWRST Synchronization Busy Mask */
#define SDADC_SYNCBUSY_SWRST(value)           (SDADC_SYNCBUSY_SWRST_Msk & ((value) << SDADC_SYNCBUSY_SWRST_Pos))
#define SDADC_SYNCBUSY_ENABLE_Pos             _U_(1)                                               /**< (SDADC_SYNCBUSY) ENABLE Synchronization Busy Position */
#define SDADC_SYNCBUSY_ENABLE_Msk             (_U_(0x1) << SDADC_SYNCBUSY_ENABLE_Pos)              /**< (SDADC_SYNCBUSY) ENABLE Synchronization Busy Mask */
#define SDADC_SYNCBUSY_ENABLE(value)          (SDADC_SYNCBUSY_ENABLE_Msk & ((value) << SDADC_SYNCBUSY_ENABLE_Pos))
#define SDADC_SYNCBUSY_CTRLC_Pos              _U_(2)                                               /**< (SDADC_SYNCBUSY) CTRLC Synchronization Busy Position */
#define SDADC_SYNCBUSY_CTRLC_Msk              (_U_(0x1) << SDADC_SYNCBUSY_CTRLC_Pos)               /**< (SDADC_SYNCBUSY) CTRLC Synchronization Busy Mask */
#define SDADC_SYNCBUSY_CTRLC(value)           (SDADC_SYNCBUSY_CTRLC_Msk & ((value) << SDADC_SYNCBUSY_CTRLC_Pos))
#define SDADC_SYNCBUSY_INPUTCTRL_Pos          _U_(3)                                               /**< (SDADC_SYNCBUSY) INPUTCTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_INPUTCTRL_Msk          (_U_(0x1) << SDADC_SYNCBUSY_INPUTCTRL_Pos)           /**< (SDADC_SYNCBUSY) INPUTCTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_INPUTCTRL(value)       (SDADC_SYNCBUSY_INPUTCTRL_Msk & ((value) << SDADC_SYNCBUSY_INPUTCTRL_Pos))
#define SDADC_SYNCBUSY_WINCTRL_Pos            _U_(4)                                               /**< (SDADC_SYNCBUSY) WINCTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_WINCTRL_Msk            (_U_(0x1) << SDADC_SYNCBUSY_WINCTRL_Pos)             /**< (SDADC_SYNCBUSY) WINCTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_WINCTRL(value)         (SDADC_SYNCBUSY_WINCTRL_Msk & ((value) << SDADC_SYNCBUSY_WINCTRL_Pos))
#define SDADC_SYNCBUSY_WINLT_Pos              _U_(5)                                               /**< (SDADC_SYNCBUSY) WINLT Synchronization Busy Position */
#define SDADC_SYNCBUSY_WINLT_Msk              (_U_(0x1) << SDADC_SYNCBUSY_WINLT_Pos)               /**< (SDADC_SYNCBUSY) WINLT Synchronization Busy Mask */
#define SDADC_SYNCBUSY_WINLT(value)           (SDADC_SYNCBUSY_WINLT_Msk & ((value) << SDADC_SYNCBUSY_WINLT_Pos))
#define SDADC_SYNCBUSY_WINUT_Pos              _U_(6)                                               /**< (SDADC_SYNCBUSY) WINUT Synchronization Busy Position */
#define SDADC_SYNCBUSY_WINUT_Msk              (_U_(0x1) << SDADC_SYNCBUSY_WINUT_Pos)               /**< (SDADC_SYNCBUSY) WINUT Synchronization Busy Mask */
#define SDADC_SYNCBUSY_WINUT(value)           (SDADC_SYNCBUSY_WINUT_Msk & ((value) << SDADC_SYNCBUSY_WINUT_Pos))
#define SDADC_SYNCBUSY_OFFSETCORR_Pos         _U_(7)                                               /**< (SDADC_SYNCBUSY) OFFSETCTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_OFFSETCORR_Msk         (_U_(0x1) << SDADC_SYNCBUSY_OFFSETCORR_Pos)          /**< (SDADC_SYNCBUSY) OFFSETCTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_OFFSETCORR(value)      (SDADC_SYNCBUSY_OFFSETCORR_Msk & ((value) << SDADC_SYNCBUSY_OFFSETCORR_Pos))
#define SDADC_SYNCBUSY_GAINCORR_Pos           _U_(8)                                               /**< (SDADC_SYNCBUSY) GAINCORR Synchronization Busy Position */
#define SDADC_SYNCBUSY_GAINCORR_Msk           (_U_(0x1) << SDADC_SYNCBUSY_GAINCORR_Pos)            /**< (SDADC_SYNCBUSY) GAINCORR Synchronization Busy Mask */
#define SDADC_SYNCBUSY_GAINCORR(value)        (SDADC_SYNCBUSY_GAINCORR_Msk & ((value) << SDADC_SYNCBUSY_GAINCORR_Pos))
#define SDADC_SYNCBUSY_SHIFTCORR_Pos          _U_(9)                                               /**< (SDADC_SYNCBUSY) SHIFTCORR Synchronization Busy Position */
#define SDADC_SYNCBUSY_SHIFTCORR_Msk          (_U_(0x1) << SDADC_SYNCBUSY_SHIFTCORR_Pos)           /**< (SDADC_SYNCBUSY) SHIFTCORR Synchronization Busy Mask */
#define SDADC_SYNCBUSY_SHIFTCORR(value)       (SDADC_SYNCBUSY_SHIFTCORR_Msk & ((value) << SDADC_SYNCBUSY_SHIFTCORR_Pos))
#define SDADC_SYNCBUSY_SWTRIG_Pos             _U_(10)                                              /**< (SDADC_SYNCBUSY) SWTRG Synchronization Busy Position */
#define SDADC_SYNCBUSY_SWTRIG_Msk             (_U_(0x1) << SDADC_SYNCBUSY_SWTRIG_Pos)              /**< (SDADC_SYNCBUSY) SWTRG Synchronization Busy Mask */
#define SDADC_SYNCBUSY_SWTRIG(value)          (SDADC_SYNCBUSY_SWTRIG_Msk & ((value) << SDADC_SYNCBUSY_SWTRIG_Pos))
#define SDADC_SYNCBUSY_ANACTRL_Pos            _U_(11)                                              /**< (SDADC_SYNCBUSY) ANACTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_ANACTRL_Msk            (_U_(0x1) << SDADC_SYNCBUSY_ANACTRL_Pos)             /**< (SDADC_SYNCBUSY) ANACTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_ANACTRL(value)         (SDADC_SYNCBUSY_ANACTRL_Msk & ((value) << SDADC_SYNCBUSY_ANACTRL_Pos))
#define SDADC_SYNCBUSY_Msk                    _U_(0x00000FFF)                                      /**< (SDADC_SYNCBUSY) Register Mask  */


/* -------- SDADC_RESULT : (SDADC Offset: 0x24) ( R/ 32) Result -------- */
#define SDADC_RESULT_RESETVALUE               _U_(0x00)                                            /**<  (SDADC_RESULT) Result  Reset Value */

#define SDADC_RESULT_RESULT_Pos               _U_(0)                                               /**< (SDADC_RESULT) Result Value Position */
#define SDADC_RESULT_RESULT_Msk               (_U_(0xFFFFFF) << SDADC_RESULT_RESULT_Pos)           /**< (SDADC_RESULT) Result Value Mask */
#define SDADC_RESULT_RESULT(value)            (SDADC_RESULT_RESULT_Msk & ((value) << SDADC_RESULT_RESULT_Pos))
#define SDADC_RESULT_RESERVED_Pos             _U_(24)                                              /**< (SDADC_RESULT) Reserved Position */
#define SDADC_RESULT_RESERVED_Msk             (_U_(0xFF) << SDADC_RESULT_RESERVED_Pos)             /**< (SDADC_RESULT) Reserved Mask */
#define SDADC_RESULT_RESERVED(value)          (SDADC_RESULT_RESERVED_Msk & ((value) << SDADC_RESULT_RESERVED_Pos))
#define SDADC_RESULT_Msk                      _U_(0xFFFFFFFF)                                      /**< (SDADC_RESULT) Register Mask  */


/* -------- SDADC_SEQCTRL : (SDADC Offset: 0x28) (R/W 8) Sequence Control -------- */
#define SDADC_SEQCTRL_RESETVALUE              _U_(0x00)                                            /**<  (SDADC_SEQCTRL) Sequence Control  Reset Value */

#define SDADC_SEQCTRL_SEQEN_Pos               _U_(0)                                               /**< (SDADC_SEQCTRL) Enable Positive Input in the Sequence Position */
#define SDADC_SEQCTRL_SEQEN_Msk               (_U_(0x7) << SDADC_SEQCTRL_SEQEN_Pos)                /**< (SDADC_SEQCTRL) Enable Positive Input in the Sequence Mask */
#define SDADC_SEQCTRL_SEQEN(value)            (SDADC_SEQCTRL_SEQEN_Msk & ((value) << SDADC_SEQCTRL_SEQEN_Pos))
#define SDADC_SEQCTRL_Msk                     _U_(0x07)                                            /**< (SDADC_SEQCTRL) Register Mask  */


/* -------- SDADC_ANACTRL : (SDADC Offset: 0x2C) (R/W 8) Analog Control -------- */
#define SDADC_ANACTRL_RESETVALUE              _U_(0x00)                                            /**<  (SDADC_ANACTRL) Analog Control  Reset Value */

#define SDADC_ANACTRL_CTRSDADC_Pos            _U_(0)                                               /**< (SDADC_ANACTRL) SDADC Control Position */
#define SDADC_ANACTRL_CTRSDADC_Msk            (_U_(0x3F) << SDADC_ANACTRL_CTRSDADC_Pos)            /**< (SDADC_ANACTRL) SDADC Control Mask */
#define SDADC_ANACTRL_CTRSDADC(value)         (SDADC_ANACTRL_CTRSDADC_Msk & ((value) << SDADC_ANACTRL_CTRSDADC_Pos))
#define SDADC_ANACTRL_ONCHOP_Pos              _U_(6)                                               /**< (SDADC_ANACTRL) Chopper Position */
#define SDADC_ANACTRL_ONCHOP_Msk              (_U_(0x1) << SDADC_ANACTRL_ONCHOP_Pos)               /**< (SDADC_ANACTRL) Chopper Mask */
#define SDADC_ANACTRL_ONCHOP(value)           (SDADC_ANACTRL_ONCHOP_Msk & ((value) << SDADC_ANACTRL_ONCHOP_Pos))
#define SDADC_ANACTRL_BUFTEST_Pos             _U_(7)                                               /**< (SDADC_ANACTRL) BUFTEST Position */
#define SDADC_ANACTRL_BUFTEST_Msk             (_U_(0x1) << SDADC_ANACTRL_BUFTEST_Pos)              /**< (SDADC_ANACTRL) BUFTEST Mask */
#define SDADC_ANACTRL_BUFTEST(value)          (SDADC_ANACTRL_BUFTEST_Msk & ((value) << SDADC_ANACTRL_BUFTEST_Pos))
#define SDADC_ANACTRL_Msk                     _U_(0xFF)                                            /**< (SDADC_ANACTRL) Register Mask  */


/* -------- SDADC_DBGCTRL : (SDADC Offset: 0x2E) (R/W 8) Debug Control -------- */
#define SDADC_DBGCTRL_RESETVALUE              _U_(0x00)                                            /**<  (SDADC_DBGCTRL) Debug Control  Reset Value */

#define SDADC_DBGCTRL_DBGRUN_Pos              _U_(0)                                               /**< (SDADC_DBGCTRL) Debug Run Position */
#define SDADC_DBGCTRL_DBGRUN_Msk              (_U_(0x1) << SDADC_DBGCTRL_DBGRUN_Pos)               /**< (SDADC_DBGCTRL) Debug Run Mask */
#define SDADC_DBGCTRL_DBGRUN(value)           (SDADC_DBGCTRL_DBGRUN_Msk & ((value) << SDADC_DBGCTRL_DBGRUN_Pos))
#define SDADC_DBGCTRL_Msk                     _U_(0x01)                                            /**< (SDADC_DBGCTRL) Register Mask  */


/** \brief SDADC register offsets definitions */
#define SDADC_CTRLA_REG_OFST           (0x00)              /**< (SDADC_CTRLA) Control A Offset */
#define SDADC_REFCTRL_REG_OFST         (0x01)              /**< (SDADC_REFCTRL) Reference Control Offset */
#define SDADC_CTRLB_REG_OFST           (0x02)              /**< (SDADC_CTRLB) Control B Offset */
#define SDADC_EVCTRL_REG_OFST          (0x04)              /**< (SDADC_EVCTRL) Event Control Offset */
#define SDADC_INTENCLR_REG_OFST        (0x05)              /**< (SDADC_INTENCLR) Interrupt Enable Clear Offset */
#define SDADC_INTENSET_REG_OFST        (0x06)              /**< (SDADC_INTENSET) Interrupt Enable Set Offset */
#define SDADC_INTFLAG_REG_OFST         (0x07)              /**< (SDADC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SDADC_SEQSTATUS_REG_OFST       (0x08)              /**< (SDADC_SEQSTATUS) Sequence Status Offset */
#define SDADC_INPUTCTRL_REG_OFST       (0x09)              /**< (SDADC_INPUTCTRL) Input Control Offset */
#define SDADC_CTRLC_REG_OFST           (0x0A)              /**< (SDADC_CTRLC) Control C Offset */
#define SDADC_WINCTRL_REG_OFST         (0x0B)              /**< (SDADC_WINCTRL) Window Monitor Control Offset */
#define SDADC_WINLT_REG_OFST           (0x0C)              /**< (SDADC_WINLT) Window Monitor Lower Threshold Offset */
#define SDADC_WINUT_REG_OFST           (0x10)              /**< (SDADC_WINUT) Window Monitor Upper Threshold Offset */
#define SDADC_OFFSETCORR_REG_OFST      (0x14)              /**< (SDADC_OFFSETCORR) Offset Correction Offset */
#define SDADC_GAINCORR_REG_OFST        (0x18)              /**< (SDADC_GAINCORR) Gain Correction Offset */
#define SDADC_SHIFTCORR_REG_OFST       (0x1A)              /**< (SDADC_SHIFTCORR) Shift Correction Offset */
#define SDADC_SWTRIG_REG_OFST          (0x1C)              /**< (SDADC_SWTRIG) Software Trigger Offset */
#define SDADC_SYNCBUSY_REG_OFST        (0x20)              /**< (SDADC_SYNCBUSY) Synchronization Busy Offset */
#define SDADC_RESULT_REG_OFST          (0x24)              /**< (SDADC_RESULT) Result Offset */
#define SDADC_SEQCTRL_REG_OFST         (0x28)              /**< (SDADC_SEQCTRL) Sequence Control Offset */
#define SDADC_ANACTRL_REG_OFST         (0x2C)              /**< (SDADC_ANACTRL) Analog Control Offset */
#define SDADC_DBGCTRL_REG_OFST         (0x2E)              /**< (SDADC_DBGCTRL) Debug Control Offset */

