Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_mc00_cnano/pic32cmmc_smart_tag_google_cloud_iot_core/firmware/src/packs/PIC32CM1216MC00032_DFP/component/sdadc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SDADC register API structure */
typedef struct
{  /* Sigma-Delta Analog Digital Converter */
  __IO  uint8_t                        SDADC_CTRLA;        /**< Offset: 0x00 (R/W  8) Control A */
  __IO  uint8_t                        SDADC_REFCTRL;      /**< Offset: 0x01 (R/W  8) Reference Control */
  __IO  uint16_t                       SDADC_CTRLB;        /**< Offset: 0x02 (R/W  16) Control B */
  __IO  uint8_t                        SDADC_EVCTRL;       /**< Offset: 0x04 (R/W  8) Event Control */
  __IO  uint8_t                        SDADC_INTENCLR;     /**< Offset: 0x05 (R/W  8) Interrupt Enable Clear */
  __IO  uint8_t                        SDADC_INTENSET;     /**< Offset: 0x06 (R/W  8) Interrupt Enable Set */
  __IO  uint8_t                        SDADC_INTFLAG;      /**< Offset: 0x07 (R/W  8) Interrupt Flag Status and Clear */
  __I   uint8_t                        SDADC_SEQSTATUS;    /**< Offset: 0x08 (R/   8) Sequence Status */
  __IO  uint8_t                        SDADC_INPUTCTRL;    /**< Offset: 0x09 (R/W  8) Input Control */
  __IO  uint8_t                        SDADC_CTRLC;        /**< Offset: 0x0A (R/W  8) Control C */
  __IO  uint8_t                        SDADC_WINCTRL;      /**< Offset: 0x0B (R/W  8) Window Monitor Control */
  __IO  uint32_t                       SDADC_WINLT;        /**< Offset: 0x0C (R/W  32) Window Monitor Lower Threshold */
  __IO  uint32_t                       SDADC_WINUT;        /**< Offset: 0x10 (R/W  32) Window Monitor Upper Threshold */
  __IO  uint32_t                       SDADC_OFFSETCORR;   /**< Offset: 0x14 (R/W  32) Offset Correction */
  __IO  uint16_t                       SDADC_GAINCORR;     /**< Offset: 0x18 (R/W  16) Gain Correction */
  __IO  uint8_t                        SDADC_SHIFTCORR;    /**< Offset: 0x1A (R/W  8) Shift Correction */
  __I   uint8_t                        Reserved1[0x01];
  __IO  uint8_t                        SDADC_SWTRIG;       /**< Offset: 0x1C (R/W  8) Software Trigger */
  __I   uint8_t                        Reserved2[0x03];
  __I   uint32_t                       SDADC_SYNCBUSY;     /**< Offset: 0x20 (R/   32) Synchronization Busy */
  __I   uint32_t                       SDADC_RESULT;       /**< Offset: 0x24 (R/   32) Result */
  __IO  uint8_t                        SDADC_SEQCTRL;      /**< Offset: 0x28 (R/W  8) Sequence Control */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint8_t                        SDADC_ANACTRL;      /**< Offset: 0x2C (R/W  8) Analog Control */
  __I   uint8_t                        Reserved4[0x01];
  __IO  uint8_t                        SDADC_DBGCTRL;      /**< Offset: 0x2E (R/W  8) Debug Control */
} sdadc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMMC00_SDADC_COMPONENT_H_ */
